Importar Librerías

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

import numpy as np
from sklearn import tree
from sklearn.model_selection import train_test_split

Importar Dataset

In [ ]:
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'
titanic = pd.read_csv(url)
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
titanic.info()

In [ ]:
titanic.Embarked.value_counts().plot(kind = 'bar', color = ['b', 'r'])
plt.title('Distribucion de Pasajeros')
plt.show()

Rellenar datos faltantes

In [ ]:
titanic['Age'] = titanic['Age'].fillna(titanic['Age'].mean())
titanic['Embarked'] = titanic['Embarked'].fillna('S')

In [ ]:
from sklearn import preprocessing
label_encoder = preprocessing.LabelEncoder()

titanic['Sex'] = label_encoder.fit_transform(titanic['Sex'])
titanic.head()
titanic['Embarked'] = label_encoder.fit_transform(titanic['Embarked'])
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0            1         0       3  ...   7.2500    NaN         2
1            2         1       1  ...  71.2833    C85         0
2            3         1       3  ...   7.9250    NaN         2
3            4         1       1  ...  53.1000   C123         2
4            5         0       3  ...   8.0500    NaN         2

[5 rows x 12 columns]

In [ ]:
titanic_num = titanic.drop(['PassengerId', 'Survived', 'Name', 'Ticket', 'Cabin'], axis = 1)
titanic_num.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500         2
1       1    0  38.0      1      0  71.2833         0
2       3    0  26.0      0      0   7.9250         2
3       1    0  35.0      1      0  53.1000         2
4       3    1  35.0      0      0   8.0500         2

In [ ]:
y_survived = titanic['Survived'].values

Dividir Dataset

In [ ]:
x_train, x_validation, y_train, y_validation = train_test_split(titanic_num, y_survived, test_size = .8, random_state = 8)

Crear Clasificador

In [ ]:
tree_titanic = tree.DecisionTreeClassifier()
tree_titanic = tree_titanic.fit(x_train, y_train)

In [ ]:
tree_titanic_accuracy = tree_titanic.score(x_validation, y_validation)
print('Accuracy: ', tree_titanic_accuracy)

Accuracy:  0.7279102384291725

In [ ]:
samuel = np.array([[3,1,30,1,0,8.5,2]])
samuel

array([[ 3. ,  1. , 30. ,  1. ,  0. ,  8.5,  2. ]])

In [ ]:
sobrevivir = tree_titanic.predict(samuel)

In [ ]:
if sobrevivir[0] == 1:
  print ("Tienes más probabilidades de Sobrevivir")
else:
  print ("Tienes más probabilidades de No Sobrevivir")

Tienes más probabilidades de No Sobrevivir

In [ ]:
from io import StringIO 
from IPython.display import Image, display
import pydotplus

out = StringIO()
tree.export_graphviz(tree_titanic, out_file = out)

graph = pydotplus.graph_from_dot_data(out.getvalue())
graph.write_png('titanic.png')

True